src/extension/InformationRegisters/mcp_НастройкиLLM.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>mcp_НастройкиLLM</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/extension/CommonModules/mcp_НастройкиLLM/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Истина, если текущий пользователь может настраивать подключение к LLM: у него полные права.
// Привилегированный режим не учитывается: в нем полные права были бы у любого пользователя.
//
// Возвращаемое значение:
//  Булево
//
Функция ЭтоАдминистратор() Экспорт

	Возврат Пользователи.ЭтоПолноправныйПользователь(, , Ложь);

КонецФункции

// Ключ личных настроек и метка запросов в журнале оркестратора: UUID элемента справочника
// Пользователи, под которым вошел текущий пользователь.
//
// Возвращаемое значение:
//  Строка
//
Функция ИдентификаторТекущегоПользователя() Экспорт

	Возврат Строка(Пользователи.АвторизованныйПользователь().УникальныйИдентификатор());

КонецФункции

// Общие настройки базы. Секретов не содержат, поэтому доступны любому пользователю формы.
//
// Возвращаемое значение:
//  Структура - см. НовыеНастройкиБазы
//
Функция НастройкиБазы() Экспорт

	Настройки = НовыеНастройкиБазы();
	Сохраненные = ПрочитатьНастройки("");
	Если Сохраненные <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Настройки, Сохраненные);
	КонецЕсли;

	Возврат Настройки;

КонецФункции

// Записывает общие настройки базы. Доступно только пользователю с полными правами.
//
// Параметры:
//  Настройки - Структура - см. НовыеНастройкиБазы; поля, которых там нет, не сохраняются
//
Процедура ЗаписатьНастройкиБазы(Знач Настройки) Экспорт

	ПроверитьПравоНастройки();

	НовыеНастройки = НовыеНастройкиБазы();
	ЗаполнитьЗначенияСвойств(НовыеНастройки, Настройки);
	НовыеНастройки.АдресОркестратора  = СокрЛП(НовыеНастройки.АдресОркестратора);
	НовыеНастройки.АдресПубликацииMCP = СокрЛП(НовыеНастройки.АдресПубликацииMCP);

	ТекстОшибки = ОшибкаАдреса(НовыеНастройки.АдресОркестратора);
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ВызватьИсключение "Адрес оркестратора: " + ТекстОшибки;
	КонецЕсли;
	ТекстОшибки = ОшибкаАдреса(НовыеНастройки.АдресПубликацииMCP);
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ВызватьИсключение "Адрес публикации MCP: " + ТекстОшибки;
	КонецЕсли;

	МинимальныйТаймаут  = 60;
	МаксимальныйТаймаут = 7200;
	Если НовыеНастройки.ТаймаутОтвета < МинимальныйТаймаут Или НовыеНастройки.ТаймаутОтвета > МаксимальныйТаймаут Тогда
		ВызватьИсключение СтрШаблон("Таймаут ответа модели должен быть от %1 до %2 секунд",
			МинимальныйТаймаут, МаксимальныйТаймаут);
	КонецЕсли;

	МинимальныйСрокТокена  = 5;
	МаксимальныйСрокТокена = 1440;
	Если НовыеНастройки.СрокДействияТокенаЗапроса < МинимальныйСрокТокена
		Или НовыеНастройки.СрокДействияТокенаЗапроса > МаксимальныйСрокТокена Тогда
		ВызватьИсключение СтрШаблон("Срок действия токена вопроса должен быть от %1 до %2 минут",
			МинимальныйСрокТокена, МаксимальныйСрокТокена);
	КонецЕсли;
	
	НовыеНастройки.Настроено = Истина;
	ЗаписатьНастройки("", НовыеНастройки);

	ЗаписьЖурналаРегистрации(ИмяСобытияЖурнала(), УровеньЖурналаРегистрации.Информация, , ,
		"Изменены общие настройки подключения к LLM");

КонецПроцедуры

// Личные настройки пользователя. Свои настройки читает любой пользователь, чужие - только
// пользователь с полными правами.
//
// Параметры:
//  ИдентификаторПользователя - Строка - UUID элемента справочника Пользователи; пустая строка - текущий
//
// Возвращаемое значение:
//  Структура - см. НовыеНастройкиПользователя
//
Функция НастройкиПользователя(Знач ИдентификаторПользователя = "") Экспорт

	ИдентификаторПользователя = ДоступныйИдентификаторПользователя(ИдентификаторПользователя);

	Настройки = НовыеНастройкиПользователя();
	Сохраненные = ПрочитатьНастройки(ИдентификаторПользователя);
	Если Сохраненные <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Настройки, Сохраненные);
	КонецЕсли;

	Возврат Настройки;

КонецФункции

// Записывает личные настройки. Пользователь меняет только свои настройки и не может сам разрешить
// себе локальный режим: флаг РазрешенЛокальныйРежим меняет только пользователь с полными правами.
//
// Параметры:
//  Настройки                 - Структура - см. НовыеНастройкиПользователя
//  ИдентификаторПользователя - Строка - UUID элемента справочника Пользователи; пустая строка - текущий
//
Процедура ЗаписатьНастройкиПользователя(Знач Настройки, Знач ИдентификаторПользователя = "") Экспорт

	ИдентификаторПользователя = ДоступныйИдентификаторПользователя(ИдентификаторПользователя);
	ПрежниеНастройки = НастройкиПользователя(ИдентификаторПользователя);

	НовыеНастройки = НовыеНастройкиПользователя();
	ЗаполнитьЗначенияСвойств(НовыеНастройки, Настройки);
	НовыеНастройки.АдресЛокальногоОркестратора = СокрЛП(НовыеНастройки.АдресЛокальногоОркестратора);

	Если Не ЭтоАдминистратор() Тогда
		НовыеНастройки.РазрешенЛокальныйРежим = ПрежниеНастройки.РазрешенЛокальныйРежим;
	КонецЕсли;
	Если Не НовыеНастройки.РазрешенЛокальныйРежим Тогда
		НовыеНастройки.ЛокальныйРежим = Ложь;
	КонецЕсли;

	ТекстОшибки = ОшибкаАдреса(НовыеНастройки.АдресЛокальногоОркестратора);
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ВызватьИсключение "Адрес локального оркестратора: " + ТекстОшибки;
	КонецЕсли;
	Если ЗначениеЗаполнено(НовыеНастройки.АдресЛокальногоОркестратора)
		И Не ЭтоЛокальныйАдрес(НовыеНастройки.АдресЛокальногоОркестратора) Тогда
		// BSLLS:UsingHardcodeNetworkAddress-off
		ВызватьИсключение "Локальный оркестратор должен слушать этот компьютер: 127.0.0.1 или localhost";
		// BSLLS:UsingHardcodeNetworkAddress-on
	КонецЕсли;

	ЗаписатьНастройки(ИдентификаторПользователя, НовыеНастройки);

КонецПроцедуры

// Настройки, по которым работает форма текущего пользователя: режим, адрес и параметры оркестратора.
// Секретов не содержат и передаются на клиент.
//
// Возвращаемое значение:
//  Структура:
//   * Режим                  - Строка - "Серверный" или "Локальный"
//   * АдресОркестратора      - Строка - адрес оркестратора для этого режима
//   * ПроверятьСертификат    - Булево - проверять сертификат HTTPS
//   * ТаймаутОтвета          - Число - секунд ожидания ответа модели
//   * Настроено              - Булево - заполнено все, что нужно для работы в этом режиме
//   * ЕстьКлюч               - Булево - ключ оркестратора для этого режима записан
//   * ЭтоАдминистратор       - Булево - пользователь может менять общие настройки
//   * РазрешенЛокальныйРежим - Булево - пользователю разрешен локальный режим
//   * Автозапуск             - Булево - запускать локальные Ollama и оркестратор, если они не отвечают
//   * ПутьКOllama            - Строка - ollama.exe на компьютере пользователя
//   * ПутьКPython            - Строка - python на компьютере пользователя
//   * КаталогОркестратора    - Строка - каталог LLM_Orchestrator.py на компьютере пользователя
//
Функция ДействующиеНастройки() Экспорт

	НастройкиБазы = НастройкиБазы();
	ЛичныеНастройки = НастройкиПользователя();

	Если ЛичныеНастройки.РазрешенЛокальныйРежим И ЛичныеНастройки.ЛокальныйРежим Тогда
		Режим = РежимЛокальный();
		АдресОркестратора = ЛичныеНастройки.АдресЛокальногоОркестратора;
	Иначе
		Режим = РежимСерверный();
		АдресОркестратора = НастройкиБазы.АдресОркестратора;
	КонецЕсли;
	ЕстьКлюч = ЕстьКлючОркестратора(Режим);

	Если Режим = РежимЛокальный() Тогда
		Настроено = ЗначениеЗаполнено(АдресОркестратора);
	Иначе
		Настроено = НастройкиБазы.Настроено И ЗначениеЗаполнено(АдресОркестратора) И ЕстьКлюч;
	КонецЕсли;

	Результат = Новый Структура;
	Результат.Вставить("Режим",                  Режим);
	Результат.Вставить("АдресОркестратора",      АдресОркестратора);
	Результат.Вставить("ПроверятьСертификат",    НастройкиБазы.ПроверятьСертификат);
	Результат.Вставить("ТаймаутОтвета",          НастройкиБазы.ТаймаутОтвета);
	Результат.Вставить("Настроено",              Настроено);
	Результат.Вставить("ЕстьКлюч",               ЕстьКлюч);
	Результат.Вставить("ЭтоАдминистратор",       ЭтоАдминистратор());
	Результат.Вставить("РазрешенЛокальныйРежим", ЛичныеНастройки.РазрешенЛокальныйРежим);
	Результат.Вставить("Автозапуск",             ЛичныеНастройки.Автозапуск);
	Результат.Вставить("ПутьКOllama",            ЛичныеНастройки.ПутьКOllama);
	Результат.Вставить("ПутьКPython",            ЛичныеНастройки.ПутьКPython);
	Результат.Вставить("КаталогОркестратора",    ЛичныеНастройки.КаталогОркестратора);

	Возврат Результат;

КонецФункции

// Где в безопасном хранилище БСП лежит ключ оркестратора для режима. Само значение ключа ни одна
// экспортная функция модуля не возвращает: ключ серверного оркестратора читает только модуль
// mcp_ОркестраторLLM непосредственно перед запросом.
//
// Параметры:
//  Режим - Строка - "Серверный" или "Локальный"
//
// Возвращаемое значение:
//  Структура:
//   * Владелец - Строка - владелец секрета в безопасном хранилище
//   * Ключ     - Строка - имя секрета
//
Функция РасположениеКлючаОркестратора(Режим) Экспорт
	
	Если Режим = РежимЛокальный() Тогда
		Возврат Новый Структура("Владелец, Ключ",
			ВладелецСекретовПользователя(ИдентификаторТекущегоПользователя()), ИмяКлючаЛокальногоОркестратора());
	КонецЕсли;
	
	Возврат Новый Структура("Владелец, Ключ", ВладелецСекретовБазы(), ИмяКлючаОркестратора());
	
КонецФункции

// Ключ локального оркестратора текущего пользователя. Создается при первом обращении. Возвращается
// только самому пользователю: в локальном режиме запрос к оркестратору делает его клиент.
//
// Возвращаемое значение:
//  Строка
//
Функция КлючЛокальногоОркестратора() Экспорт
	
	Если Не НастройкиПользователя().РазрешенЛокальныйРежим Тогда
		ВызватьИсключение "Локальный режим не разрешен администратором";
	КонецЕсли;
	
	Расположение = РасположениеКлючаОркестратора(РежимЛокальный());
	Ключ = ПрочитатьСекрет(Расположение.Владелец, Расположение.Ключ);
	Если Не ЗначениеЗаполнено(Ключ) Тогда
		Ключ = НовыйКлюч();
		ЗаписатьСекрет(Расположение.Владелец, Расположение.Ключ, Ключ);
	КонецЕсли;
	
	Возврат Ключ;
	
КонецФункции

// Записывает ключ серверного оркестратора. Доступно только пользователю с полными правами.
//
// Параметры:
//  Ключ - Строка - ключ клиента из конфигурации оркестратора; пустая строка удаляет ключ
//
Процедура ЗаписатьКлючОркестратора(Знач Ключ) Экспорт

	ПроверитьПравоНастройки();

	Ключ = СокрЛП(Ключ);
	МинимальнаяДлинаКлюча = 32;
	Если ЗначениеЗаполнено(Ключ) И СтрДлина(Ключ) < МинимальнаяДлинаКлюча Тогда
		ВызватьИсключение СтрШаблон("Ключ оркестратора короче %1 символов: используйте ключ, который выдал оркестратор",
			МинимальнаяДлинаКлюча);
	КонецЕсли;

	ЗначениеСекрета = Неопределено;
	Если ЗначениеЗаполнено(Ключ) Тогда
		ЗначениеСекрета = Ключ;
	КонецЕсли;
	ЗаписатьСекрет(ВладелецСекретовБазы(), ИмяКлючаОркестратора(), ЗначениеСекрета);

	ЗаписьЖурналаРегистрации(ИмяСобытияЖурнала(), УровеньЖурналаРегистрации.Информация, , ,
		"Изменен ключ серверного оркестратора");

КонецПроцедуры

// Истина, если ключ оркестратора для режима записан. Ключ локального оркестратора создается
// автоматически, поэтому для локального режима всегда Истина.
//
// Параметры:
//  Режим - Строка - "Серверный" или "Локальный"
//
// Возвращаемое значение:
//  Булево
//
Функция ЕстьКлючОркестратора(Режим) Экспорт

	Если Режим = РежимЛокальный() Тогда
		Возврат Истина;
	КонецЕсли;

	Возврат ЗначениеЗаполнено(ПрочитатьСекрет(ВладелецСекретовБазы(), ИмяКлючаОркестратора()));

КонецФункции

// Новый случайный ключ: 64 шестнадцатеричных символа из двух случайных UUID.
//
// Возвращаемое значение:
//  Строка
//
Функция НовыйКлюч() Экспорт

	Возврат СтрЗаменить(Строка(Новый УникальныйИдентификатор) + Строка(Новый УникальныйИдентификатор), "-", "");

КонецФункции

// Имя серверного режима: оркестратор общий, запрос к нему делает сервер 1С.
//
// Возвращаемое значение:
//  Строка
//
Функция РежимСерверный() Экспорт

	Возврат "Серверный";

КонецФункции

// Имя локального режима: оркестратор на компьютере пользователя, запрос к нему делает клиент 1С.
//
// Возвращаемое значение:
//  Строка
//
Функция РежимЛокальный() Экспорт

	Возврат "Локальный";

КонецФункции

// Истина, если адрес указывает на этот же компьютер: по такому адресу ключ не уходит в сеть.
//
// Параметры:
//  Адрес - Строка - URL вида http://127.0.0.1:9000
//
// Возвращаемое значение:
//  Булево
//
Функция ЭтоЛокальныйАдрес(Знач Адрес) Экспорт

	Попытка
		Узел = НРег(mcp_ОбщегоНазначения.РазобратьURL(Адрес).Хост);
	Исключение
		// Адрес, который не разбирается, локальным не считается
		Возврат Ложь;
	КонецПопытки;

	// Адрес обратной петли сравнивается с текстом: это проверка, а не адрес подключения
	Возврат Узел = "127.0.0.1" Или Узел = "localhost"; // BSLLS:UsingHardcodeNetworkAddress-off

КонецФункции

// Пользователи, которым администратор разрешил локальный режим. Доступно только администратору.
//
// Возвращаемое значение:
//  Массив из Структура:
//   * ИдентификаторПользователя - Строка - UUID элемента справочника Пользователи
//   * Пользователь              - Строка - наименование пользователя; пусто, если элемент удален
//   * ЛокальныйРежим            - Булево - пользователь включил локальный режим у себя
//
Функция ПользователиСЛокальнымРежимом() Экспорт

	ПроверитьПравоНастройки();

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиLLM.Пользователь КАК Пользователь,
	|	НастройкиLLM.Настройки КАК Настройки
	|ИЗ
	|	РегистрСведений.mcp_НастройкиLLM КАК НастройкиLLM
	|ГДЕ
	|	НастройкиLLM.Пользователь <> """"";

	УстановитьПривилегированныйРежим(Истина);
	Попытка
		Выборка = Запрос.Выполнить().Выбрать();
	Исключение
		УстановитьПривилегированныйРежим(Ложь);
		ВызватьИсключение;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);

	Результат = Новый Массив;
	Ссылки = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Настройки = Выборка.Настройки.Получить();
		Если ТипЗнч(Настройки) <> Тип("Структура")
			Или Не СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(Выборка.Пользователь)
			Или Не ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Настройки, "РазрешенЛокальныйРежим", Ложь) Тогда
			Продолжить;
		КонецЕсли;
		Ссылка = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор(Выборка.Пользователь));
		Ссылки.Добавить(Ссылка);

		ОписаниеПользователя = Новый Структура("ИдентификаторПользователя, Пользователь", Выборка.Пользователь, "");
		ОписаниеПользователя.Вставить("ЛокальныйРежим", ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Настройки,
			"ЛокальныйРежим", Ложь));
		ОписаниеПользователя.Вставить("Ссылка", Ссылка);
		Результат.Добавить(ОписаниеПользователя);
	КонецЦикла;

	Наименования = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Ссылки, "Наименование");
	Для Каждого ОписаниеПользователя Из Результат Цикл
		Наименование = Наименования.Получить(ОписаниеПользователя.Ссылка);
		Если ТипЗнч(Наименование) = Тип("Строка") Тогда
			ОписаниеПользователя.Пользователь = Наименование;
		КонецЕсли;
		ОписаниеПользователя.Удалить("Ссылка");
	КонецЦикла;

	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Общие настройки базы по умолчанию.
//
// Возвращаемое значение:
//  Структура:
//   * АдресОркестратора            - Строка - адрес серверного оркестратора, например https://gpu-server:9443
//   * ПроверятьСертификат          - Булево - проверять сертификат HTTPS оркестратора
//   * ТаймаутОтвета                - Число - секунд ожидания ответа модели
//   * АдресПубликацииMCP           - Строка - адрес HTTP-сервиса mcp_APIBackend для оркестратора
//   * ДоступКИнструментамБезТокена - Булево - разрешать tools/call без токена пользователя
//   * СрокДействияТокенаЗапроса    - Число - минут действия токена одного вопроса
//   * Настроено                    - Булево - администратор сохранил настройки
//
Функция НовыеНастройкиБазы()

	Настройки = Новый Структура;
	Настройки.Вставить("АдресОркестратора",            "");
	Настройки.Вставить("ПроверятьСертификат",          Истина);
	Настройки.Вставить("ТаймаутОтвета",                1800);
	Настройки.Вставить("АдресПубликацииMCP",           "");
	Настройки.Вставить("ДоступКИнструментамБезТокена", Истина);
	Настройки.Вставить("СрокДействияТокенаЗапроса",    30);
	Настройки.Вставить("Настроено",                    Ложь);

	Возврат Настройки;

КонецФункции

// Личные настройки пользователя по умолчанию.
//
// Возвращаемое значение:
//  Структура:
//   * РазрешенЛокальныйРежим      - Булево - разрешение администратора
//   * ЛокальныйРежим              - Булево - пользователь работает с оркестратором на своем компьютере
//   * АдресЛокальногоОркестратора - Строка - только 127.0.0.1 или localhost
//   * Автозапуск                  - Булево - запускать Ollama и оркестратор, если они не отвечают
//   * ПутьКOllama                 - Строка - путь к ollama.exe
//   * ПутьКPython                 - Строка - путь к python или имя команды
//   * КаталогОркестратора         - Строка - каталог, куда выгружается LLM_Orchestrator.py
//
Функция НовыеНастройкиПользователя()

	Настройки = Новый Структура;
	Настройки.Вставить("РазрешенЛокальныйРежим",      Ложь);
	Настройки.Вставить("ЛокальныйРежим",              Ложь);
	Настройки.Вставить("АдресЛокальногоОркестратора", "http://127.0.0.1:9000"); // BSLLS:UsingHardcodeNetworkAddress-off
	Настройки.Вставить("Автозапуск",                  Ложь);
	Настройки.Вставить("ПутьКOllama",                 "");
	Настройки.Вставить("ПутьКPython",                 "python");
	Настройки.Вставить("КаталогОркестратора",         "");

	Возврат Настройки;

КонецФункции

// Пустой идентификатор заменяется текущим пользователем; чужой идентификатор доступен только
// пользователю с полными правами.
//
// Параметры:
//  ИдентификаторПользователя - Строка - UUID элемента справочника Пользователи или пустая строка
//
// Возвращаемое значение:
//  Строка - UUID пользователя, чьи настройки читаются или пишутся
//
Функция ДоступныйИдентификаторПользователя(ИдентификаторПользователя)

	ТекущийИдентификатор = ИдентификаторТекущегоПользователя();
	Если Не ЗначениеЗаполнено(ИдентификаторПользователя) Или ИдентификаторПользователя = ТекущийИдентификатор Тогда
		Возврат ТекущийИдентификатор;
	КонецЕсли;

	ПроверитьПравоНастройки();
	Возврат ИдентификаторПользователя;

КонецФункции

// Вызывает исключение, если у текущего пользователя нет полных прав.
Процедура ПроверитьПравоНастройки()

	Если Не ЭтоАдминистратор() Тогда
		ВызватьИсключение "Настраивать подключение к LLM может только пользователь с полными правами";
	КонецЕсли;

КонецПроцедуры

// Текст ошибки адреса или пустая строка. Пустой адрес ошибкой не считается; принимаются только
// http и https.
//
// Параметры:
//  Адрес - Строка - проверяемый URL
//
// Возвращаемое значение:
//  Строка
//
Функция ОшибкаАдреса(Адрес)

	Если Не ЗначениеЗаполнено(Адрес) Тогда
		Возврат "";
	КонецЕсли;

	НижнийАдрес = НРег(Адрес);
	Если Не СтрНачинаетсяС(НижнийАдрес, "http://") И Не СтрНачинаетсяС(НижнийАдрес, "https://") Тогда
		Возврат "нужен адрес вида http://сервер:порт или https://сервер:порт";
	КонецЕсли;

	Попытка
		ЧастиАдреса = mcp_ОбщегоНазначения.РазобратьURL(Адрес);
	Исключение
		Возврат "адрес не разбирается: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	Если Не ЗначениеЗаполнено(ЧастиАдреса.Хост) Тогда
		Возврат "не указан сервер";
	КонецЕсли;

	Возврат "";

КонецФункции

#Область Хранение

// Прав на регистр mcp_НастройкиLLM и безопасное хранилище БСП нет ни в одной роли расширения, поэтому
// чтение и запись выполняются в привилегированном режиме. Права пользователя проверяются до этого
// в программном интерфейсе модуля. Привилегированный общий модуль в расширении платформа не допускает.

// Читает настройки из регистра mcp_НастройкиLLM.
//
// Параметры:
//  ИдентификаторПользователя - Строка - UUID пользователя; пустая строка - общие настройки базы
//
// Возвращаемое значение:
//  Структура, Неопределено - сохраненные настройки; Неопределено, если записи нет
//
Функция ПрочитатьНастройки(ИдентификаторПользователя)

	УстановитьПривилегированныйРежим(Истина);
	Попытка
		МенеджерЗаписи = РегистрыСведений.mcp_НастройкиLLM.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Пользователь = ИдентификаторПользователя;
		МенеджерЗаписи.Прочитать();
		Настройки = Неопределено;
		Если МенеджерЗаписи.Выбран() Тогда
			Настройки = МенеджерЗаписи.Настройки.Получить();
		КонецЕсли;
	Исключение
		УстановитьПривилегированныйРежим(Ложь);
		ВызватьИсключение;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);

	Если ТипЗнч(Настройки) <> Тип("Структура") Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат Настройки;

КонецФункции

// Записывает настройки в регистр mcp_НастройкиLLM, заменяя прежние.
//
// Параметры:
//  ИдентификаторПользователя - Строка - UUID пользователя; пустая строка - общие настройки базы
//  Настройки                 - Структура - настройки без секретов
//
Процедура ЗаписатьНастройки(ИдентификаторПользователя, Знач Настройки)

	УстановитьПривилегированныйРежим(Истина);
	Попытка
		МенеджерЗаписи = РегистрыСведений.mcp_НастройкиLLM.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Пользователь = ИдентификаторПользователя;
		МенеджерЗаписи.Настройки    = Новый ХранилищеЗначения(Настройки);
		МенеджерЗаписи.Записать(Истина);
	Исключение
		УстановитьПривилегированныйРежим(Ложь);
		ВызватьИсключение;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

// Читает секрет из безопасного хранилища БСП.
//
// Параметры:
//  Владелец - Строка - владелец секрета, до 128 символов
//  Ключ     - Строка - имя секрета по правилам идентификаторов
//
// Возвращаемое значение:
//  Произвольный - значение секрета; Неопределено, если секрета нет
//
Функция ПрочитатьСекрет(Владелец, Ключ)

	УстановитьПривилегированныйРежим(Истина);
	Попытка
		Данные = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Владелец, Ключ);
	Исключение
		УстановитьПривилегированныйРежим(Ложь);
		ВызватьИсключение;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);

	Возврат Данные;

КонецФункции

// Записывает секрет в безопасное хранилище БСП.
//
// Параметры:
//  Владелец - Строка - владелец секрета, до 128 символов
//  Ключ     - Строка - имя секрета по правилам идентификаторов
//  Данные   - Произвольный - значение секрета; Неопределено удаляет секрет
//
Процедура ЗаписатьСекрет(Владелец, Ключ, Данные)

	УстановитьПривилегированныйРежим(Истина);
	Попытка
		Если Данные = Неопределено Тогда
			ОбщегоНазначения.УдалитьДанныеИзБезопасногоХранилища(Владелец, Ключ);
		Иначе
			ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(Владелец, Данные, Ключ);
		КонецЕсли;
	Исключение
		УстановитьПривилегированныйРежим(Ложь);
		ВызватьИсключение;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

#КонецОбласти

// Владелец общих секретов в безопасном хранилище БСП.
//
// Возвращаемое значение:
//  Строка
//
Функция ВладелецСекретовБазы()

	Возврат "MCP_Сервер.ОркестраторLLM";

КонецФункции

// Владелец личных секретов пользователя в безопасном хранилище БСП.
//
// Параметры:
//  ИдентификаторПользователя - Строка - UUID элемента справочника Пользователи
//
// Возвращаемое значение:
//  Строка
//
Функция ВладелецСекретовПользователя(ИдентификаторПользователя)

	Возврат "MCP_Сервер.ОркестраторLLM." + ИдентификаторПользователя;

КонецФункции

// Имя секрета с ключом серверного оркестратора.
//
// Возвращаемое значение:
//  Строка
//
Функция ИмяКлючаОркестратора()

	Возврат "КлючОркестратора";

КонецФункции

// Имя секрета с ключом локального оркестратора пользователя.
//
// Возвращаемое значение:
//  Строка
//
Функция ИмяКлючаЛокальногоОркестратора()

	Возврат "КлючЛокальногоОркестратора";

КонецФункции

// Событие журнала регистрации для изменений настроек.
//
// Возвращаемое значение:
//  Строка
//
Функция ИмяСобытияЖурнала()

	Возврат "MCP.НастройкиLLM";

КонецФункции

#КонецОбласти
